{
  "poems": [
    {
      "title": "A Coat",
      "author": "William Butler Yeats",
      "content": "I made my song a coat\nCovered with embroideries\nOut of old mythologies\nFrom heel to throat;\nBut the fools caught it,\nWore it in the world's eyes\nAs though they'd wrought it.\nSong, let them take it\nFor there's more enterprise\nIn walking naked."
    },
    {
      "title": "The road not taken",
      "author": "Robert Frost",
      "content": "Two roads diverged in a yellow wood,\nAnd sorry I could not travel both\nAnd be one traveler, long I stood\nAnd looked down one as far as I could\nTo where it bent in the undergrowth;\nThen took the other, as just as fair,\nAnd having perhaps the better claim,\nBecause it was grassy and wanted wear\nThough as for that the passing there\nHad worn them really about the same,\nAnd both that morning equally lay\nIn leaves no step had trodden black.\nOh, I kept the first for another day!\nYet knowing how way leads onto way,\nI doubted if I should ever come back.\nI shall be telling this with a sigh\nSomewhere ages and ages hence;\nTwo roads diverged in a wood, and I\nI took the one less traveled by,\nAnd that has made all the difference."
    },
    {
      "title": "To the Virgins, to Make Much of Time",
      "author": "Robert Herrick",
      "content": "Gather ye rosebuds while ye may,\nOld time is still a-flying;\nAnd this same flower that smiles today\nTomorrow will be dying.\nThe glorious lamp of heaven the sun,\nThe higher he's a-getting,\nThe sooner will his race be run,\nAnd nearer he's to setting.\nThat age is best which is the first,\nWhen youth and blood are warmer;\nBut being spent, the worse, and worst\nTimes still succeed the former.\nThen be not coy, but use your time,\nAnd, while ye may, go marry;\nFor, having lost but once your prime,\nYou may forever tarry."
    },
    {
      "title": "A Dream Within A Dream",
      "author": "Edgar Allan Poe",
      "content": "Take this kiss upon the brow!\nAnd, in parting from you now,\nThus much let me avow--\nYou are not wrong, who deem\nThat my days have been a dream;\nYet if hope has flown away\nIn a night, or in a day,\nIn a vision, or in none,\nIs it therefore the less gone?\nAll that we see or seem\nIs but a dream within a dream.\nI stand amid the roar\nOf a surf-tormented shore,\nAnd I hold within my hand\nGrains of the golden sand--\nHow few! yet how they creep\nThrough my fingers to the deep,\nWhile I weep--while I weep!\nO God! can I not grasp\nThem with a tighter clasp?\nO God! can I not save\nOne from the pitiless wave?\nIs all that we see or seem\nBut a dream within a dream?"
    },
    {
      "title": "As The Sparrow",
      "author": "Charles Bukowski",
      "content": "To give life you must take life,\nand as our grief falls flat and hollow\nupon the billion-blooded sea\nI pass upon serious inward-breaking shoals rimmed\nwith white-legged, white-bellied rotting creatures\nlengthily dead and rioting against surrounding scenes.\nDear child, I only did to you what the sparrow\ndid to you; I am old when it is fashionable to be\nyoung; I cry when it is fashionable to laugh.\nI hated you when it would have taken less courage\nto love."
    },
    {
      "title": "Do not go gentle into that good night",
      "author": "Dylan Thomas",
      "content": "Do not go gentle into that good night,\nOld age should burn and rave at close of day;\nRage, rage against the dying of the light.\n\nThough wise men at their end know dark is right,\nBecause their words had forked no lightning they\nDo not go gentle into that good night.\n\nGood men, the last wave by, crying how bright\nTheir frail deeds might have danced in a green bay,\nRage, rage against the dying of the light.\n\nWild men who caught and sang the sun in flight,\nAnd learn, too late, they grieved it on its way,\nDo not go gentle into that good night.\n\nGrave men, near death, who see with blinding sight\nBlind eyes could blaze like meteors and be gay,\nRage, rage against the dying of the light.\n\nAnd you, my father, there on the sad height,\nCurse, bless, me now with your fierce tears, I pray.\nDo not go gentle into that good night.\nRage, rage against the dying of the light."
    },
    {
      "title": "In Flanders Fields",
      "author": "John McCrae",
      "content": "In Flanders fields the poppies blow\nBetween the crosses, row on row,\nThat mark our place, and in the sky,\nThe larks, still bravely singing, fly,\nScarce heard amid the guns below.\n\nWe are the dead; short days ago\nWe lived, felt dawn, saw sunset glow,\nLoved and were loved, and now we lie\nIn Flanders fields.\n\nTake up our quarrel with the foe!\nTo you from failing hands we throw\nThe torch; be yours to hold it high!\nIf ye break faith with us who die\nWe shall not sleep, though poppies grow\nIn Flanders fields."
    },
    {
      "title": "Heaven Is What I Cannot Reach!",
      "author": "Emily Dickinson",
      "content": "Heaven is what I cannot reach!\nThe apple on the tree,\nProvided it do hopeless hang,\nThat \"heaven\" is, to me.\n\nThe color on the cruising cloud,\nThe interdicted ground\nBehind the hill, the house behind, --\nThere Paradise is found!"
    },
    {
      "title": "The Raven",
      "author": "Edgar Allan Poe",
      "content": "ONCE upon a midnight dreary, while I pondered, weak and weary,\nOver many a quaint and curious volume of forgotten lore,-\nWhile I nodded, nearly napping, suddenly there came a tapping,\nAs of some one gently rapping, rapping at my chamber door.\n\"'T is some visitor,\" I muttered, \"tapping at my chamber door;\nOnly this and nothing more.\"\n\nAh, distinctly I remember it was in the bleak December\nAnd each separate dying ember wrought its ghost upon the floor.\nEagerly I wished the morrow;-vainly I had sought to borrow\nFrom my books surcease of sorrow-sorrow for the lost Lenore,\nFor the rare and radiant maiden whom the angels name Lenore:\nNameless here for evermore.\n\nAnd the silken sad uncertain rustling of each purple curtain\nThrilled me-filled me with fantastic terrors never felt before;\nSo that now, to still the beating of my heart, I stood repeating\n\"'T is some visitor entreating entrance at my chamber door,\nSome late visitor entreating entrance at my chamber door:\nThis it is and nothing more.\"\n\nPresently my soul grew stronger; hesitating then no longer,\n\"Sir,\" said I, \"or Madam, truly your forgiveness I implore;\nBut the fact is I was napping, and so gently you came rapping,\nAnd so faintly you came tapping, tapping at my chamber door,\nThat I scarce was sure I heard you\"-here I opened wide the door:-\nDarkness there and nothing more.\n\nDeep into that darkness peering, long I stood there wondering, fearing,\nDoubting, dreaming dreams no mortals ever dared to dream before;\nBut the silence was unbroken, and the stillness gave no token,\nAnd the only word there spoken was the whispered word, \"Lenore?\"\nThis I whispered, and an echo murmured back the word, \"Lenore:\"\nMerely this and nothing more.\n\nBack into the chamber turning, all my soul within me burning,\nSoon again I heard a tapping somewhat louder than before.\n\"Surely,\" said I, \"surely that is something at my window lattice;\nLet me see, then, what thereat is, and this mystery explore;\nLet my heart be still a moment and this mystery explore:\n'T is the wind and nothing more.\"\n\nOpen here I flung the shutter, when, with many a flirt and flutter,\nIn there stepped a stately Raven of the saintly days of yore.\nNot the least obeisance made he; not a minute stopped or stayed he;\nBut, with mien of lord or lady, perched above my chamber door,\nPerched upon a bust of Pallas just above my chamber door:\nPerched, and sat, and nothing more.\n\nThen this ebony bird beguiling my sad fancy into smiling\nBy the grave and stern decorum of the countenance it wore,-\n\"Though thy crest be shorn and shaven, thou,\" I said, \"art sure no craven,\nGhastly grim and ancient Raven wandering from the Nightly shore:\nTell me what thy lordly name is on the Night's Plutonian shore!\"\nQuoth the Raven, \"Nevermore.\"\n\nMuch I marvelled this ungainly fowl to hear discourse so plainly,\nThough its answer little meaning-little relevancy bore;\nFor we cannot help agreeing that no living human being\nEver yet was blessed with seeing bird above his chamber door,\nBird or beast upon the sculptured bust above his chamber door,\nWith such name as \"Nevermore.\"\n\nBut the Raven, sitting lonely on the placid bust, spoke only\nThat one word, as if his soul in that one word he did outpour.\nNothing further then he uttered, not a feather then he fluttered,\nTill I scarcely more than muttered,-\"Other friends have flown before;\nOn the morrow he will leave me, as my Hopes have flown before.\"\nThen the bird said, \"Nevermore.\"\n\nStartled at the stillness broken by reply so aptly spoken,\n\"Doubtless,\" said I, \"what it utters is its only stock and store,\nCaught from some unhappy master whom unmerciful Disaster\nFollowed fast and followed faster till his songs one burden bore:\nTill the dirges of his Hope that melancholy burden bore\nOf 'Never-nevermore.'\n\nBut the Raven still beguiling all my fancy into smiling,\nStraight I wheeled a cushioned seat in front of bird and bust and door;\nThen, upon the velvet sinking, I betook myself to linking\nFancy unto fancy, thinking what this ominous bird of yore,\nWhat this grim, ungainly, ghastly, gaunt, and ominous bird of yore\nMeant in croaking \"Nevermore.\"\n\nThis I sat engaged in guessing, but no syllable expressing\nTo the fowl whose fiery eyes now burned into my bosom's core;\nThis and more I sat divining, with my head at ease reclining\nOn the cushion's velvet lining that the lamplight gloated o'er,\nBut whose velvet violet lining with the lamp-light gloating o'er\nShe shall press, ah, nevermore!\n\nThen, methought, the air grew denser, perfumed from an unseen censer\nSwung by seraphim whose foot-falls tinkled on the tufted floor.\n\"Wretch,\" I cried, \"thy God hath lent thee-by these angels he hath sent thee\nRespite-respite and nepenthe from thy memories of Lenore!\"\nQuaff, oh quaff this kind nepenthe, and forget this lost Lenore.\"\nQuoth the Raven, \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil! prophet still, if bird or devil!\nWhether Tempter sent, or whether tempest tossed thee here ashore,\nDesolate yet all undaunted, on this desert land enchanted-\nOn this home by Horror haunted-tell me truly, I implore:\nIs there-is there balm in Gilead?-tell me-tell me, I implore!\"\nQuoth the Raven, \"Nevermore.\"\n\n\"Prophet!\" said I, \"thing of evil-prophet still, if bird or devil!\nBy that Heaven that bends above us, by that God we both adore,\nTell this soul with sorrow laden if, within the distant Aidenn,\nIt shall clasp a sainted maiden whom the angels name Lenore:\nClasp a rare and radiant maiden whom the angels name Lenore!\"\nQuoth the Raven, \"Nevermore.\"\n\n\"Be that word our sign of parting, bird or fiend!\" I shrieked, upstarting:\n\"Get thee back into the tempest and the Night's Plutonian shore!\nLeave no black plume as a token of that lie thy soul hath spoken!\nLeave my loneliness unbroken! quit the bust above my door!\nTake thy beak from out my heart, and take thy form from off my door!\"\nQuoth the Raven, \"Nevermore.\"\n\nAnd the Raven, never flitting, still is sitting, still is sitting\nOn the pallid bust of Pallas just above my chamber door;\nAnd his eyes have all the seeming of a demon's that is dreaming,\nAnd the lamp-light o'er him streaming throws his shadow on the floor:\nAnd my soul from out that shadow that lies floating on the floor\nShall be lifted-nevermore!"
    },
    {
      "title": "Morning",
      "author": "Billy Collins",
      "content": "Why do we bother with the rest of the day,\nthe swale of the afternoon,\nthe sudden dip into evening,\n\nthen night with his notorious perfumes,\nhis many-pointed stars?\n\nThis is the best-\nthrowing off the light covers,\nfeet on the cold floor,\nand buzzing around the house on espresso-\n\nmaybe a splash of water on the face,\na palmful of vitamins-\nbut mostly buzzing around the house on espresso,\n\ndictionary and atlas open on the rug,\nthe typewriter waiting for the key of the head,\na cello on the radio,\n\nand, if necessary, the windows-\ntrees fifty, a hundred years old\nout there,\nheavy clouds on the way\nand the lawn steaming like a horse\nin the early morning."
    },
    {
      "title": "If You Forget Me",
      "author": "Pablo Neruda",
      "content": "I want you to know\none thing.\n\nYou know how this is:\nif I look\nat the crystal moon, at the red branch\nof the slow autumn at my window,\nif I touch\nnear the fire\nthe impalpable ash\nor the wrinkled body of the log,\neverything carries me to you,\nas if everything that exists,\naromas, light, metals,\nwere little boats\nthat sail\ntoward those isles of yours that wait for me.\n\nWell, now,\nif little by little you stop loving me\nI shall stop loving you little by little.\n\nIf suddenly\nyou forget me\ndo not look for me,\nfor I shall already have forgotten you.\n\nIf you think it long and mad,\nthe wind of banners\nthat passes through my life,\nand you decide\nto leave me at the shore\nof the heart where I have roots,\nremember\nthat on that day,\nat that hour,\nI shall lift my arms\nand my roots will set off\nto seek another land.\n\nBut\nif each day,\neach hour,\nyou feel that you are destined for me\nwith implacable sweetness,\nif each day a flower\nclimbs up to your lips to seek me,\nah my love, ah my own,\nin me all that fire is repeated,\nin me nothing is extinguished or forgotten,\nmy love feeds on your love, beloved,\nand as long as you live it will be in your arms\nwithout leaving mine."
    },
    {
      "title": "Dreams",
      "author": "Langston Hughes",
      "content": "Hold fast to dreams\nFor if dreams die\nLife is a broken-winged bird\nThat cannot fly.\nHold fast to dreams\nFor when dreams go\nLife is a barren field\nFrozen with snow."
    },
    {
      "title": "Fox",
      "author": "Caki Wilkinson",
      "content": "The yards grow ghosts. Between the limbs and wings,\nbleached street-lit things, I'm best at moving on.\nHunt-heavy, gray, slunk overlow like so\nmuch weight got in the way, my shape's the shape\nof something missed, flash-pop or empty frame.\nThough you could say I've made a game of this,\nand though midtrickery it might be true,\nwhen evening lingers in the key of leaving\nmy senses swoon. A synonym for stay,\nI'm always coming back. I chew through traps.\nI love whatever doesn't get too close."
    },
    {
      "title": "Serenity",
      "author": "Edward Rowland Sill",
      "content": "Brook,\nBe still, - be still!\nMidnight's arch is broken\nIn thy ceaseless ripples.\nDark and cold below them\nRuns the troubled water, -\nOnly on its bosom,\nShimmering and trembling,\nDoth the glinted star-shine\nSparkle and cease.\n\nLife,\nBe still, - be still!\nBoundless truth is shattered\nOn thy hurrying current.\nRest, with face uplifted,\nCalm, serenely quiet;\nDrink the deathless beauty -\nThrills of love and wonder\nSinking, shining, star-like;\nTill the mirrored heaven\nHollow down within thee\nHoly deeps unfathomed,\nWhere far thoughts go floating,\nAnd low voices wander\nWhispering peace."
    },
    {
      "title": "Wall of Darkness",
      "author": "Diana van den Berg",
      "content": "I stood and looked in the cool of the twilight -\nthe sun was peacefully sinking low,\nher last rays glowing and lovingly encompassing\nthe world in a soft and rich, warm glow.\n\nSuddenly a trembling, rumbling, grumbling\nshook the world of that mighty plain.\nand out of the east, with a powerful thundering,\nthe wild black horses of dark night came,\n\nTossing their heads as they galloped in number,\ntheir tails outstretched in the whistling wind.\nI stood transfixed as they surged towards me,\nunable to move or turn away.\n\nLarger and larger they grew and larger,\nuntil in their race they surrounded me.\nWith thrashing hooves in their furious charge,\nthey rushed right on to the western sea.\n\nUntil they reached those deep, deep waters,\nand left me behind in the night - alone."
    }
  ]
}
